{
  "blogs":[
  {
    id: 1,
    date: 30,
    month: "Jun",
    year: 2016,
    title: "4th of July 2016: How to celebrate freedom",
    author: { name: "Admin", url: "" },
    publishedOn: "Thu, 06/30/2016 - 00:51",
    url: "blog/4th-of-july-2016-how-to-celebrate-freedom.html",
    img: {
      src: "4th-of-July-How-to-clebrate-freedom.webp",
      alt: "celebrate-freedom",
    },
    excerpt:
      "The 4th of July is observed as a federal holiday in the United States. After all, it’s NATION’S BIRTHDAY! Independence Day celebration is a grand and colorful affair in the country with fireworks, foods, parades, and more. Wondering how to enjoy this wonderful day? Check this out. Known ways to celebrate Independence Day To celebrate the grandeur of the ...",
  },
  {
    id: 2,
    date: 29,
    month: "Jun",
    year: 2016,
    title: "OVLG gave me the perfect recipe to smash debt: Live on one income",
    author: { name: "Admin", url: "" },
    publishedOn: "Wed, 06/29/2016 - 02:05",
    url: "blog/ovlg-gave-me-the-perfect-recipe-to-smash-debt-live-on-one-income.html",
    img: {
      src: "meet-KM-the-girl-who-lived-on-one-income-to-save.webp",
      alt: "become-debt-free-in-one-income",
    },
    excerpt:
      "This post has been made by KM, an ordinary girl who paid off debts by living on one income and accepting OVLG as her financial friend. “Sometimes, I feel that it is more painful to pay off debt than giving birth to a child. The endless negotiations and the stress of carrying debt boulder on your shoulder 24*7 are too much. You can neither sleep nor walk stress- ...",
  },
  {
    id: 3,
    date: 2,
    month: "Apr",
    year: 2016,
    title: "Last-minute financial moves you must make in this tax season",
    author: { name: "Admin", url: "" },
    publishedOn: "Sat, 04/02/2016 - 00:07",
    url: "blog/financial-to-do.html",
    img: {
      src: "Financial-To-Do--Apr-2016-1.webp",
      alt: "april financial to-do",
    },
    excerpt:
      "File a new W-4 form for a better return on investment.Book your air tickets to keep your expenses down on your summer travel plans.Check how your budget performed in the first quarter of 2016. Change it if necessary.Use your extra money to reduce your credit card debts and student loan debts.Make smart investing plans to qualify for tax deductions in the next ...",
  },
  {
    id: 4,
    date: 19,
    month: "Nov",
    year: 2015,
    title: "Thanksgiving 2015: 4 Financial prospects to be thankful for",
    author: { name: "Admin", url: "" },
    publishedOn: "Thu, 11/19/2015 - 02:49",
    url: "blog/thanksgiving-2015-4-financial-prospects-to-be-thankful-for.html",
    img: {
      src: "Thanksgiving-2015-4-Financial-prospects-to-be-thankful-for.webp",
      alt: "thanksgiving-2015-financial-prospects",
    },
    excerpt:
      "You are often thankful for various things like good health, promising relationship, etc. But, why not thank those financial prospects that come your way? I’m not talking about the promotion that you’ve got this year or the biggest trip that you’ve enjoyed with your family. Apart from these, there are still some other reasons that you should be thankful for. ...",
  },
  {
    id: 5,
    date: 4,
    month: "Nov",
    year: 2015,
    title: "This Veterans Day: Show a new path to the veterans",
    author: { name: "Admin", url: "" },
    publishedOn: "Wed, 11/04/2015 - 21:56",
    url: "blog/this-veterans-day-show-a-new-path-to-the-veterans.html",
    img: {
      src: "This-Veterans-Day-Show-a-new-financial-path-to-the-veterans.webp",
      alt: "help-needy-and-retired-veterans",
    },
    excerpt:
      "“A hero is someone who has given his or her life to something bigger than oneself.” - Joseph Campbell.Eleventh November is observed as the Veterans Day. This year let’s plan something different for our heroes. Always remember, the peaceful nights we spend are gifts from the warriors of our country.The experience and courage of our soldiers keep us protected ...",
  },
  {
    "id":6,"date":"28","month":"Oct","year":"2015","title":"5 Weird steps that helped me get out of debt sooner","author":{"name":"","url":""},"publishedOn":"","url":"blog\/5-weird-steps-that-helped-me-get-out-of-debt-sooner.html","img":{"src":"https:\/\/www.ovlg.com\/styles\/oakviewlaw\/blob\/images\/imgo.jpg","alt":"weird-steps-to-become-debt-free"},"excerpt":"It is easy to get plunged into a sea of despair when confronting mammoth debt burdens. When you fail to pay them with normal and minimal efforts, you start believing them to remain with you forever.\r\nHowever, if there is a will, you can ambush even the biggest balances in record time. Apart from some real help from a professional entity, I undertook some steps ( ..."
  },
  {"id":7,"date":"22","month":"Sep","year":"2015","title":"The vibrant fall season: 5 Ideas to enjoy the getaways with family","author":{"name":"","url":""},"publishedOn":"","url":"blog\/the-vibrant-fall-season-5-ideas-to-enjoy-the-getaways-with-family.html","img":{"src":"https:\/\/www.ovlg.com\/styles\/oakviewlaw\/blob\/images\/Vibrant-fall-7-Ideas-to-enjoy-the-getaways-with-your-family.jpg","alt":"enjoy-fall-season-with-family"},"excerpt":"The season \"fall\" is the most colorful time of the year. Most of the places are surrounded by the beautiful shades of vibrant colors and some are beautifully covered with the rolling vineyard. Conventionally, this colorful foliage season is ideal to have some outdoor fun with family.\r\nHere are some fun ideas to experience with your family before the icy chilly ..."},
  
  {"id":8,"date":"27","month":"Aug","year":"2015","title":"The journey of a young girl - From financial mess to financial victory","author":{"name":"","url":""},"publishedOn":"","url":"blog\/the-journey-of-a-young-girl-from-financial-mess-to-financial-victory.html","img":{"src":"https:\/\/www.ovlg.com\/styles\/oakviewlaw\/blob\/images\/the-journey-of-a-young-girl-from-financial-mess-to-financial-victory.jpg","alt":"journey-of-a-young-girl"},"excerpt":"The title of this story reminds me of the classic - Anne Frank -The Diary of a young girl. But believe me, I couldn’t think of a better title for this story ever since I decided to show my journey from financial mess to financial victory to the whole world out there. And the similarities between the 2 titles end in the phrase ‘young girl’ only. That’s ..."},

{"id":9,"date":"18","month":"Aug","year":"2015","title":"History of women in law","author":{"name":"","url":""},"publishedOn":"","url":"blog\/history-of-women-in-law.html","img":{"src":"https:\/\/www.ovlg.com\/styles\/oakviewlaw\/blob\/images\/history-of-women-in-law.jpg","alt":"history-of-women"},"excerpt":"August 26 - the day commemorates the passage of the 19th Amendment in 1920 granting women the right to vote in America. Since this day, the United States has witnessed four female U.S. Supreme Court justices and a U.S. Attorney General. While this might seem as a tremendous success for a class who were once devoid of voting rights, we still await the first female ..."},

{"id":10,"date":"24","month":"Jun","year":"2015","title":"Mistakes which can delay your financial independence","author":{"name":"","url":""},"publishedOn":"","url":"blog\/mistakes-which-can-delay-your-financial-independence.html","img":{"src":"https:\/\/www.ovlg.com\/styles\/oakviewlaw\/blob\/images\/mistakes-which-can-delay-your-financial-independence.jpg","alt":"mistakes-which-delay-your-financial-independence"},"excerpt":"Mistakes are very common and obvious things, especially when it comes to finance. Both youngsters and elders make costly money mistakes. And this includes dads too. There's a proverb you may know, “The man who makes no mistakes does not usually make anything.” Most often, many of you are feeling guilty of some of your financial mistakes. However, you must ..."},

{"id":11,"date":"17","month":"Jun","year":"2015","title":"Even your dad’s money mistakes count: Repeating can cost you big","author":{"name":"","url":""},"publishedOn":"","url":"blog\/even-your-dads-money-mistakes-count-repeating-can-cost-you-big.html","img":{"src":"https:\/\/www.ovlg.com\/styles\/oakviewlaw\/blob\/images\/even-your-dad%E2%80%99s-money-mistakes-count-repeating-can-cost-you-big.jpg","alt":"money-mistakes"},"excerpt":"This post has been shared by Amy Nickson.Financial mistakes are very common things. There are many people who suffered a lot due to some fatal money mistakes they did in their life. Remember, mistakes are mistakes. No matter how old are you, how rich are you, even what position you’re holding in your professional life. During my childhood I wondered, “ I’m so ..."},

{"id":12,"date":"21","month":"May","year":"2015","title":"Memorial Day Weekend in Washington D.C: The fast-lane of celebrations","author":{"name":"","url":""},"publishedOn":"","url":"blog\/memorial-day-weekend-in-washington-dc-the-fast-lane-of-celebrations.html","img":{"src":"https:\/\/www.ovlg.com\/styles\/oakviewlaw\/blob\/images\/celebrate-memorial-day-in-washington-dc.jpg","alt":"memorial-day-celebrations"},"excerpt":"On this Memorial Day, veterans and fallen heroes would be honored in the nation’s capital. Here’s the itinerary of the celebration: No Memorial Day in DC is complete without mentioning the National Memorial Day Parade. Started on since 2005, the parade is largest of its kind in the U.S. is put up by the American Veterans Center in honor of those servicemen and ..."},

{"id":13,"date":"18","month":"May","year":"2015","title":"9 Ways you can be dollarwise on Memorial Day","author":{"name":"","url":""},"publishedOn":"","url":"blog\/9-ways-you-can-be-dollarwise-on-memorial-day.html","img":{"src":"https:\/\/www.ovlg.com\/styles\/oakviewlaw\/blob\/images\/blog\/9-ways-you-can-be-dollarwise-on-memorial-day.jpg","alt":"be-dollarwise-on-memorial-day"},"excerpt":"Memorial Day is approaching. And the best part is, no other event will much popular in summer than this Day. Because, Memorial Day is very popular for shopping, having good foods with friends and guests and having summer fun. This is such an event when millions of people will hit the store to buy appliance, gadgets. They will even hit hotels to have good foods or ..."},

{"id":14,"date":"12","month":"May","year":"2015","title":"OVLG marks it's 8th Anniversary and is still going strong!","author":{"name":"","url":""},"publishedOn":"","url":"blog\/ovlg-completes-eight-years-and-is-still-going-strong.html","img":{"src":"https:\/\/www.ovlg.com\/styles\/oakviewlaw\/blob\/images\/ovlg-foundation-day.jpg","alt":"OVLG completes 8 years successfully"},"excerpt":"Eight years ago, OVLG was launched with the dream of protecting consumers' rights and strengthening their financial house. That dream has been fulfilled but only partially. So, in the next 8 years, we'll work harder to achieve our dreams and aspirations. Just be there and wish us good luck. Hopefully, we'll be able to save financial lives of many more people ..."},

{"id":15,"date":"29","month":"Apr","year":"2015","title":"Mother’s Day - 10 Gifts your mom would love to have in her kitty ","author":{"name":"","url":""},"publishedOn":"","url":"blog\/mothers-day-10-gifts-your-mom-would-love-to-have-in-her-kitty.html","img":{"src":"https:\/\/www.ovlg.com\/styles\/oakviewlaw\/blob\/images\/blog\/mothers-day-10-gifts-your-mom-would-love-to-have-in-her-kitty.jpg","alt":"mother's-day-gifts"},"excerpt":"Finding the perfect gift for mom on Mother’s Day is super-exciting - but it is tough as well. You don’t know which gift will be perfect for your mom.I have created a list of gift ideas that are budget-friendly and interesting as well. Your job will be to pick ones that your mom would love to have in her kitty.Budget-friendly gifts for your momHere’s my list ..."},

{"id":16,"date":"22","month":"Apr","year":"2015","title":"Thank you OVLG for being my savior! I'm finally on my way to debt free life","author":{"name":"","url":""},"publishedOn":"","url":"blog\/thank-you-ovlg-for-being-my-savior.html","img":{"src":"https:\/\/www.ovlg.com\/styles\/oakviewlaw\/blob\/images\/Martha-story.jpg","alt":"martha's story of becoming debt free"},"excerpt":"Hi! This is the story of Martha Jackson who lives in Nevada and is currently working as a freelancer for Oak View Law Group. Five years back, her student loan debt messed up her otherwise happy life and pushed her towards the edge of financial cliff. At one point, she had to plan her every step in order to survive in this merciless world. But after she came in touch ..."},

{"id":17,"date":"15","month":"Apr","year":"2015","title":"Make a green oath - 51 Ways to save mother earth and your wallet","author":{"name":"","url":""},"publishedOn":"","url":"blog\/make-a-green-oath-51-ways-to-save-mother-earth-and-your-wallet.html","img":{"src":"https:\/\/www.ovlg.com\/styles\/oakviewlaw\/blob\/images\/make-a-green-oath.jpg","alt":"save mother earth"},"excerpt":"“Care for Mother Earth just like you care for your money Leave a green earth and beautiful money tree for your kids”Mother nature is least bothered about the Earth day. In her dictionary, each day is an Earth Day and therefore she expects that we will take care of nature 24*7. But for us, Earth Day falls on April 22. This is the day when we are suddenly ..."},

{"id":18,"date":"13","month":"Apr","year":"2015","title":"Last-minute tax relief measures taken by the IRS for FY 2014","author":{"name":"","url":""},"publishedOn":"","url":"blog\/last-minute-tax-relief-measures-taken-by-the-irs-for-fy-2014.html","img":{"src":"https:\/\/www.ovlg.com\/styles\/oakviewlaw\/blob\/images\/last-minute-tax-relief-measures-taken-by-irs.jpg","alt":"tax-relief-measures-taken-by-irs"},"excerpt":"Better late than never. The IRS is ready with it’s bag loaded with last-minute relief measures for business owners, employees and everyone else. Have a look at this article to know about it.Obamacare penalty reliefEmployersNo penalties if there are only 50 employeesNo penalties for S corporations with above 2% shareholdersNo penalties for a S corporation with ..."},

{"id":19,"date":"8","month":"Apr","year":"2015","title":"John Schneider and David Auten's Journey to Debt Free Life","author":{"name":"","url":""},"publishedOn":"","url":"blog\/john-schneider-and-david-autens-journey-to-debt-free-life.html","img":{"src":"https:\/\/www.ovlg.com\/styles\/oakviewlaw\/blob\/images\/John-and-David.jpg","alt":"Debt Free Guys Interview"},"excerpt":"Apart from offering frugal tips, rich household budgeting ideas, and legal fixes for debt problems, it’s also our duty to publish stories of real people who took control of their finances and defeated debt.\r\nToday we are bringing you the story of John & David - a gay couple from Denver, Colorado, who have been living together now for last 11 years. Apart from ..."},

{"id":20,"date":"31","month":"Mar","year":"2015","title":"Easter celebration ideas for penny-pinchers to have a memorable day","author":{"name":"","url":""},"publishedOn":"","url":"blog\/easter-celebration-ideas-for-penny-pinchers-to-have-a-memorable-day.html","img":{"src":"https:\/\/www.ovlg.com\/styles\/oakviewlaw\/blob\/images\/easter-celebration-ideas-for-penny-pinchers.jpg","alt":"easter-celebration-ideas"},"excerpt":"You must be preparing to celebrate Easter as well as spring events in your town. The itinerary for the celebrations could include egg hunts, games, puppet show, visits with the Easter Bunny and so on. However, before you embark on any such journey, pay a heed to the events that folks across the country are planning for themselves this Easter and you can follow suit. ..."},

{"id":21,"date":"24","month":"Mar","year":"2015","title":"Oaki's handpicked list of 11 tweets that help you fix debt ","author":{"name":"","url":""},"publishedOn":"","url":"blog\/best-debt-tweets.html","img":{"src":"https:\/\/www.ovlg.com\/styles\/oakviewlaw\/blob\/images\/OVLG-blog-post.jpg","alt":"Best tweets on debt"},"excerpt":"1. “Debt is nothing more than impatience expressed in money”\r\n \r\n You can view the entire article at - http:\/\/t.co\/nh5P9KIKei\r\nOaki says, \r\nYou know what’s the best part of this tweet? It captures the central idea of the article and expresses it smartly. Impatience will invite debt troubles and patience will help to build wealth. An impatient man will divorce ..."},

{"id":22,"date":"12","month":"Mar","year":"2015","title":"Oaki - OVLG mascot gives financial joy and hope to helpless ","author":{"name":"","url":""},"publishedOn":"","url":"blog\/oaki-ovlg-mascot-has-finally-arrived-to-give-life-to-your-money-tree.html","img":{"src":"https:\/\/www.ovlg.com\/styles\/oakviewlaw\/blob\/images\/Oaki_intro.jpg","alt":"OAKI"},"excerpt":"Hi!\r\nI’m Oaki - OVLG’s new mascot. I’m here to make your financial life wonderful and sexy. Ya..ya..I know you’ve been eagerly waiting for me for many days. And, frankly speaking, yes I’m a bit late. But, not anymore. I have finally arrived and as a penalty for being late,\r\n“I solemnly promise to be the guardian angel of your financial life”\r\nBeing a ..."},

{"id":23,"date":"6","month":"Mar","year":"2015","title":"Women’s Day: It's still a man's world when it comes to money","author":{"name":"","url":""},"publishedOn":"","url":"blog\/womens-day-its-still-a-mans-world-when-it-comes-to-money.html","img":{"src":"https:\/\/www.ovlg.com\/styles\/oakviewlaw\/blob\/images\/Womenâ\u0080\u0099sDay.jpg","alt":"it is still a man's world"},"excerpt":"No matter how much we talk about feminism or equality on the International Women's Day, the fact remains that this is still a man's world. Especially, when we are talking about financial power in the US. Women earn significantly less than men in almost every state of the country. On an average, women earn $10,291 less than men in all the states of the country. As ..."},

{"id":24,"date":"12","month":"Feb","year":"2015","title":"5 Ideas to enjoy a winter break on President’s Day weekend","author":{"name":"","url":""},"publishedOn":"","url":"blog\/5-ideas-to-enjoy-a-winter-break-on-presidents-day-weekend.html","img":{"src":"https:\/\/www.ovlg.com\/styles\/oakviewlaw\/blob\/images\/blog\/5-Ideas-to-enjoy-a-winter-break-on-Presidents-Day-weekend.jpg","alt":" enjoy presidents day"},"excerpt":"President's day weekend is a great opportunity to take a long winter break with family. In honor of our founding fathers (Washington, Jefferson and Madison) you can visit some historical places with family. Here are some ideas to plan a getaway to enjoy the winter season and get some rejuvenating energy too. The long weekend is perfect to enjoy a romantic V-Day ..."},

{"id":25,"date":"10","month":"Feb","year":"2015","title":"Family and not desire wins: Save more for a brighter tomorrow","author":{"name":"","url":""},"publishedOn":"","url":"blog\/family-and-not-desire-wins-save-more-for-a-brighter-tomorrow.html","img":{"src":"https:\/\/www.ovlg.com\/styles\/oakviewlaw\/blob\/images\/save-more-for-a-brighter-tomorrow.jpg","alt":"save money"},"excerpt":"(Characters - Rick and Anne & their 4 year old son - Rhode)\r\nAmidst the chilly ambience of a wintry afternoon, the slanted rays of the Sun has created a serene black and white backdrop capable of immortal shots. The space here looks eerie but then, it doesn't have to be that way either. \r\nAt one corner of the room, one could hear some vague discussions. Who is ..."},

{"id":26,"date":"28","month":"Jan","year":"2015","title":"The Eureka moments: How roses can make your pocket full of posies","author":{"name":"","url":""},"publishedOn":"","url":"blog\/the-eureka-moments-how-roses-can-make-your-pocket-full-of-posies.html","img":{"src":"https:\/\/www.ovlg.com\/styles\/oakviewlaw\/blob\/images\/The-Eureka-moments--How-roses-can-make-your-pocket-full-of-posies.jpg","alt":"eureka moments"},"excerpt":"Ring-a-ring o' roses,\r\nA pocket full of posies,\r\nA-tishoo! A-tishoo!\r\nWe all fall down.\r\nNow, lets make it very clear, we have not gathered here to discuss about the Great Plague of London, 1665\/6 or the Black Death triggered by the bubonic plague in Europe during the 1340s. The objective of this article is to inspire myself and all the others folks like me to beat ..."},

{"id":27,"date":"1","month":"Jan","year":"2015","title":"11 Super stars of 2014 - How they tamed debt with OVLG","author":{"name":"","url":""},"publishedOn":"","url":"blog\/eleven-super-stars-of-2014-how-they-tamed-debt-with-ovlg.html","img":{"src":"https:\/\/www.ovlg.com\/styles\/oakviewlaw\/blob\/images\/blog\/Main-image.jpg","alt":"11 people who paid off debt through OVLG"},"excerpt":"Finally, the much awaited 2015 has arrived. Some are busy in continuing with the celebrations whereas others are analyzing their highs and lows in the bygone year. 2014 was eventful for OVLG for more than one reason. We have already highlighted that in our previous blogpost – Flashback 2014. Now, as 2015 has begun, let us look at the best debt free success ..."},

{"id":28,"date":"30","month":"Dec","year":"2014","title":"Milestones achieved by OVLG in 2014 - Flashback","author":{"name":"","url":""},"publishedOn":"","url":"blog\/milestones-achieved-by-ovlg-in-2014-flashback.html","img":{"src":"https:\/\/www.ovlg.com\/styles\/oakviewlaw\/blob\/images\/cover-image.jpg","alt":"ovlg in 2014"},"excerpt":"7 Years back, Oak View law Group (OVLG) was only a small law firm with a few number of employees. In 2014, Oak View Law Group has emerged as one of the biggest law firms in the country. With 2036 successful clients and 356 positive reviews to its credit, OVLG has brought smiles in the face of thousands of people in the country. It's goal is to give a ray of hope to ..."},

{"id":29,"date":"23","month":"Dec","year":"2014","title":"5 Christmas movies that teach money lessons","author":{"name":"","url":""},"publishedOn":"","url":"blog\/5-christmas-movies-that-teach-money-lessons.html","img":{"src":"https:\/\/www.ovlg.com\/styles\/oakviewlaw\/blob\/images\/5-Christmas-movies-that-teach-money-lessons.jpg","alt":"christmas movies that teach money lessons"},"excerpt":"Now when it's just two weeks to Christmas, you should do no delay and start watching some of the classic Christmas movies. Not only just to soak in the mellow of the holiday season, but also to learn a whole lot of new things, including some financial lessons.Check out the following points and know which movies you should watch this Christmas to master some better ..."},

{"id":30,"date":"19","month":"Dec","year":"2014","title":"How I got financial independence: The story of a wannabe millionaire","author":{"name":"","url":""},"publishedOn":"","url":"blog\/how-i-got-financial-independence-the-story-of-a-wannabe-millionaire.html","img":{"src":"https:\/\/www.ovlg.com\/styles\/oakviewlaw\/blob\/images\/How-I-got-financial-independence--The-story-of-a-wannabe-millionaire.jpg","alt":"financial independence"},"excerpt":"This post is contributed by one of our highly esteemed OVLG fans. Check out this inpiring story of a wannabe millionaire who achieved financial independence by playing the monetary cards right.All of us have goals. Either they are good or bad. Everything’s fine, until we set for ourselves some impractical, overtly ambitious goals. And as per researches conducted ..."},

{"id":31,"date":"16","month":"Dec","year":"2014","title":"Cheap Christmas gift ideas to make celebrations affordable","author":{"name":"","url":""},"publishedOn":"","url":"blog\/cheap-christmas-gift-ideas-to-make-celebrations-affordable.html","img":{"src":"https:\/\/www.ovlg.com\/styles\/oakviewlaw\/blob\/images\/Fascinating-Christmas-gifts-Ideas-for-all-smart-people.jpg","alt":"cheap christmas gift ideas"},"excerpt":"Christmas is full of fun but it can give you a stressful time too. But, if I’m not wrong, Christmas doesn’t have to be burden on the wallet, your mood as well as on the environment. Wondering “how” is this possible? Well, read this article to get affordable Christmas gift ideas.Do you know that you can spend fun-filled holidays without spending lavishly on ..."},

{"id":32,"date":"5","month":"Dec","year":"2014","title":"How I finally paid off $30,000 and got out of debt bed","author":{"name":"","url":""},"publishedOn":"","url":"blog\/how-ovlg-helped-a-client-to-pay-off-credit-card-debt.html","img":{"src":"\/styles\/oakviewlaw\/blob\/images\/credit-cards-are-injurious-to-my-financial-health.jpg","alt":"credit cards are injurious to my financial health"},"excerpt":"One of our clients recently paid off a huge amount of credit card debt. Read his inspiring story to know how he did this miracle.\r\n“Smoking is injurious to health.”\r\n“ Likewise, credit cards are injurious to my financial health”\r\n\r\nThis is the mantra which helped me to pay off $30532 and save $7579. Don't raise your eyebrow in shock or ..."},

{"id":33,"date":"26","month":"Nov","year":"2014","title":"5 Tips for shopping during Cyber Monday","author":{"name":"","url":""},"publishedOn":"","url":"blog\/5-tips-for-shopping-during-cyber-monday.html","img":{"src":"https:\/\/www.ovlg.com\/styles\/oakviewlaw\/blob\/images\/Tips-for-shopping-during-Cyber-Monday.jpg","alt":"shopping for cyber monday"},"excerpt":"Once the Thanksgiving Day and Black Friday is gone, Cyber Monday will be knocking at the door. You must be getting tempted to have some good time with shopping on this day. However, have you determined your budget yet and the items to be purchased on that day? Since it is going to be the biggest spending day of the year, here are 5 strategies to save the most from ..."},

{"id":34,"date":"25","month":"Nov","year":"2014","title":"5 Stuffs you should not buy this Black Friday","author":{"name":"","url":""},"publishedOn":"","url":"blog\/5-stuffs-you-should-not-buy-this-black-friday.html","img":{"src":"https:\/\/www.ovlg.com\/styles\/oakviewlaw\/blob\/images\/7-Stuffs-you-should-not-buy-this-Black-Friday.jpg","alt":"black friday shopping"},"excerpt":"Many might deny Black Friday's relevance as a shopping event, still there are millions who are looking to snatch the best deals on this day - just after Thanksgiving, on 28th. According to estimates by the National Retail Federation, the coming weekend is going to be a win-win situation for the retailers, with around 140 million Americans are expected to shop both ..."},

{"id":35,"date":"18","month":"Nov","year":"2014","title":"Shopping for Black Friday? Things to struck off your shopping list","author":{"name":"","url":""},"publishedOn":"","url":"blog\/shopping-for-black-friday-things-to-struck-off-your-shopping-list.html","img":{"src":"https:\/\/www.ovlg.com\/styles\/oakviewlaw\/blob\/images\/Shopping-for-Black-Friday--Things-to-struck-off-your-shopping-list.jpg","alt":"black friday shopping"},"excerpt":"There is no dearth for shopping deals and discounts this season. However, there are certain things that you shouldn't buy on November 29th. This is because there are particular items that would be available at a much cheaper rate later in December and New Year than on this Black Friday.\r\nList of items to avoid this Black Friday\r\nHere is a list of some items that ..."},

{"id":36,"date":"17","month":"Nov","year":"2014","title":"Cruise celebration: Delight your mood differently on this Thanksgiving Day","author":{"name":"","url":""},"publishedOn":"","url":"blog\/onboard-thanksgiving-day-delight-your-mood-while-floating-on-river.html","img":{"src":"https:\/\/www.ovlg.com\/styles\/oakviewlaw\/blob\/images\/Celebrate-Thanksgiving-on-cruises.jpg","alt":"onboard thanksgiving"},"excerpt":"Is this year too special for you? Have you just retired from work or do have your 5th marriage anniversary in this year? Whatever the reason is, if you want to make this Thanksgiving Day really memorable, then onboard celebration plan is perfect. Celebrate this Thanksgiving Day on cruise with your families. Your kids will enjoy the cruise celebration along his\/her ..."},

{"id":37,"date":"29","month":"Oct","year":"2014","title":"How to make the Halloween day extra-special and memorable within budget ","author":{"name":"","url":""},"publishedOn":"","url":"blog\/how-to-make-the-halloween-day-extra-special-and-memorable-within-budget.html","img":{"src":"https:\/\/www.ovlg.com\/styles\/oakviewlaw\/blob\/images\/How-to-make-the-halloween-day-extra-special-and-memorable-within-budget.jpg","alt":"make halloween day extra special within budget"},"excerpt":"Halloween holds a strong position in the \"most expensive holidays\" category. Last minute costume changes and sudden shopping trips can create a big hole in your pocket. Halloween comes only once a year, so technically it is not a crime to go on a shopping spree for only one day. However, the problem is, Halloween kick-starts the festive season, which means you ..."},

{"id":38,"date":"15","month":"Oct","year":"2014","title":"Halloween smart celebration strategy: Let the money spook RIP","author":{"name":"","url":""},"publishedOn":"","url":"blog\/halloween-smart-celebration-strategy-let-the-money-spooks-rip.html","img":{"src":"https:\/\/www.ovlg.com\/styles\/oakviewlaw\/blob\/images\/celebrate-halloween.jpg","alt":"celebrate halloween day smartly"},"excerpt":"Celebrations for the Halloween doesn't have to cost you a fortune. And you won't even have to blow your budget for things like candies and costumes, just to buy a single item for the same. Rather, you could quite easily use some of the most practical costume ideas this year to create trendy, budget-friendly Halloween costumes in your home.\r\nBudget-friendly ideas ..."},

{"id":39,"date":"13","month":"Oct","year":"2014","title":"365 Days Planner - How to keep your boss on your toes from 16th Oct","author":{"name":"","url":""},"publishedOn":"","url":"blog\/365-days-planner-how-to-keep-your-boss-on-your-toes-from-16th-oct.html","img":{"src":"https:\/\/www.ovlg.com\/styles\/oakviewlaw\/blob\/images\/365-Days-Planner-How-to-keep-your-boss-on-your-toes-from-16th-Oct.jpg","alt":"365 days planner"},"excerpt":"Like anyone else, you would want to keep your Boss under your control. After all, your boss possesses the remote-control of your career. So, if you really wish to have a shining career, then you really need to woo your Boss. Now the question is, how can you woo your difficult and temperamental Boss? What should you really do to get his\/her attention? Okay, don’t ..."},

{"id":40,"date":"28","month":"Aug","year":"2014","title":"Labor Day: Grab attractive deals and make smart choices to have a budget-friendly weekend ","author":{"name":"","url":""},"publishedOn":"","url":"blog\/labor-day-grab-attractive-deals-and-make-smart-choices-to-have-a-budget-friendly-weekend.html","img":{"src":"https:\/\/www.ovlg.com\/styles\/oakviewlaw\/blob\/images\/blog\/Labour-Day--Save-money.jpg","alt":"labor day"},"excerpt":"Labor Day weekend is just around the corner. It is the perfect time to take a break from your busy schedule and enjoy with your family. After all, this holiday is dedicated to all the Americans who work throughout the year for a better America. The federal government acknowledges the contributions of fellow country men and has gifted them with one day off work. ..."},

{"id":41,"date":"25","month":"Jul","year":"2014","title":"Parents' Day - Give insights on how to avoid investment scams to your mom and dad","author":{"name":"","url":""},"publishedOn":"","url":"blog\/parents-day-give-insights-on-how-to-avoid-investment-scams-to-your-mom-and-dad","img":{"src":"https:\/\/www.ovlg.com\/styles\/oakviewlaw\/blob\/images\/parents-day.jpg","alt":"parents'day"},"excerpt":"Seniors are easy targets of scammers. However, with the basic understanding of how scammers work, seniors can easily safeguard their hard earned dollars. Having a clear idea about how to make safe investments can create a huge difference in your parents' retirement years, and as dutiful son or daughter, you should always help them to attain that. \r\nThis year, on ..."},

{"id":42,"date":"20","month":"Jun","year":"2014","title":"OVLG migrates from WordPress to Drupal architecture - A simple and strong website ","author":{"name":"","url":""},"publishedOn":"","url":"blog\/ovlg-migrates-from-wordpress-to-drupal-architecture","img":{"src":"https:\/\/www.ovlg.com\/styles\/oakviewlaw\/blob\/images\/drupal_vs_wordpress.jpg","alt":""},"excerpt":"Oak View Law Group (OVLG) has integrated Drupal architecture to make the website user-friendly and secured. The new architecture has a powerful data management system and hopefully this will benefit clients, attorneys and other users all alike.\r\n\r\nNew architecture for better security and features\r\n\r\nBeing a law firm, OVLG understands the importance of having ..."},

{"id":43,"date":"19","month":"May","year":"2014","title":"Best legal solutions to get over overdue balances","author":{"name":"","url":""},"publishedOn":"","url":"blog\/best-legal-solutions-to-get-over-overdue-balances","img":{"src":"https:\/\/www.ovlg.com\/styles\/oakviewlaw\/blob\/images\/image_pic4.jpg","alt":"Overdue balance"},"excerpt":"Wondering how to clear the outstanding balance on your credit cards? Contact OVLG and get the best legal solution to your debt problems ..."},

{"id":44,"date":"12","month":"May","year":"2014","title":"One stop shop for any financial complications","author":{"name":"","url":""},"publishedOn":"","url":"blog\/one-stop-shop-for-any-financial-complications","img":{"src":"https:\/\/www.ovlg.com\/styles\/oakviewlaw\/blob\/images\/image_pic5.jpg","alt":"Financial complications"},"excerpt":"Wondering how to get out of wallowing debt? Tired of looking for solutions to untangle your financial complications? If yes, then just dial the Toll Free number (800) 530-OVLG to start the process of solving your problems. OVLG is the one stop shop for any financial complications. We are there to help you end your financial problems at a positive note. Be it a debt ..."},

{"id":45,"date":"30","month":"Apr","year":"2014","title":"OVLG Giveaway Contest – Participate and grab your iPad Air","author":{"name":"","url":""},"publishedOn":"","url":"blog\/ovlg-giveaway-contest-participate-and-grab-your-ipad-air","img":{"src":"\/styles\/oakviewlaw\/blob\/images\/blog\/OVLG-Giveaway-Contest-image-copy.jpg","alt":"OVLG Giveaway iPad"},"excerpt":"OVLG has come up with a new and interesting contest for the people. It’s called the OVLG iPad Giveaway wherein you get a chance to win an iPad Air. Rules of the contest The rules are pretty simple and easy. All you need to do is to follow a few rules:Post a comment on OVLG FB Wall.Share or like a post on OVLG Pinterest.Follow OVLG on Twitter. Tweet or re-tweet posts ..."},

{"id":46,"date":"17","month":"Apr","year":"2014","title":"Shop and have a gala celebration on this Easter - 5 Last-minute budget friendly tips ","author":{"name":"","url":""},"publishedOn":"","url":"blog\/shop-and-have-a-gala-celebration-on-this-easter-5-last-minute-budget-friendly-tips","img":{"src":"https:\/\/www.ovlg.com\/styles\/oakviewlaw\/blob\/images\/5-Last-minute-budget-friendly-tips.jpg","alt":"college debt rises while the doe sleeps"},"excerpt":"Holidays bring a smile on your face since this is the time to celebrate. With less than a few days to go, it's high time for Easter shopping. It is expected that people will spend almost $2.26 billion on Easter candy in 2014. Now, that's a lot of money and it's a pity to spend it on Easter, especially when credit card and student debts are rampant in the country.\r\n\r\n ..."},

{"id":47,"date":"3","month":"Mar","year":"2014","title":"Chapter 7 bankruptcy discharge: What liens can it quash and how","author":{"name":"","url":""},"publishedOn":"","url":"blog\/chapter-7-bankruptcy-discharge-what-liens-can-it-quash-and-how","img":{"src":"\/styles\/oakviewlaw\/blob\/images\/blog\/Chapter-Liens.jpg","alt":"\"chapter 7 bankruptcy\""},"excerpt":"Bankruptcy can discharge you of your obligation to payback a secured loan. However, if a creditor puts a lien on your property, then it’ll survive your Chapter 7 bankruptcy discharge, provided you’ve not returned the concerned property to the concerned creditor.What do you mean by a lien?Lien is created by a creditor or any one that has a security interest over ..."},

{"id":48,"date":"27","month":"Feb","year":"2014","title":"Credit score - Why does it go up and down throughout the year? ","author":{"name":"","url":""},"publishedOn":"","url":"blog\/credit-score-why-does-it-go-up-and-down-throughout-the-year","img":{"src":"\/styles\/oakviewlaw\/blob\/images\/blog\/Credit-score-Why-does-it-go-up-and-down1.jpg","alt":"Why credit score goes up and down"},"excerpt":"Credit score fluctuations are a normal phenomenon and there is nothing to worry about. Credit score can change from day to day and bureau to bureau. So, next time you see a change in your score, don't get flustered and start panicking.Credit score can go up and down for various reasons. Several factors affect your score. Once you know about these factors, you'll find ..."},

{"id":49,"date":"13","month":"Feb","year":"2014","title":"How to avoid overspending and debt with the right spending style","author":{"name":"","url":""},"publishedOn":"","url":"blog\/how-to-avoid-overspending-and-debt-with-the-right-spending-style","img":{"src":"\/styles\/oakviewlaw\/blob\/images\/blog\/Spending-Habits.jpg","alt":""},"excerpt":"Your spending style determines if you'll be in debt. Right spending style will help you save money and avoid credit crunch in 2014. It will help you achieve your financial dreams and aspirations. On the other hand, wrong spending style will just pave the path to bankruptcy.Read along to know about the 5 spending styles that will help you avoid and pay off your debts ..."},

{"id":50,"date":"29","month":"Dec","year":"2013","title":"Introducing consumer survey on service and website","author":{"name":"","url":""},"publishedOn":"","url":"blog\/introducing-consumer-survey-on-service-and-website","img":{"src":"\/styles\/oakviewlaw\/blob\/images\/blog\/12.jpg","alt":"OVLG Feedback section"},"excerpt":"It has been a constant effort on the part of Oak View Law Group (OVLG) to deliver the best to its audience and clients. We constantly work towards positive changes.We seek your honest opinion.\r\n\r\nOak View Law Group is proud to introduce its \"Feedback\" section! This is just a click away to the left of your computer screen.\r\n\r\n \r\n\r\nSimple steps to give your feedback\r\n\r\n ..."},

{"id":51,"date":"8","month":"Oct","year":"2013","title":"OVLG launches Credit Repair and Stay Violation Protection services","author":{"name":"","url":""},"publishedOn":"","url":"blog\/ovlg-launches-credit-repair-and-stay-violation-protection-services","img":{"src":"https:\/\/www.ovlg.com\/styles\/oakviewlaw\/blob\/images\/blog\/sb1.jpg","alt":"OVLG starts new services"},"excerpt":"Oak View Law Group (OVLG) recently launched two new services aiming consumers, who are trying to regain their financial foothold. With more than 6 years of industry experience, OVLG is proud to announce the new Credit Repair service and Stay Violation Protection, as it continues to help people with their credit and debt problems.\r\n\r\nStarting from October, these ..."},

{"id":52,"date":"11","month":"Oct","year":"2012","title":"OVLG is glad to introduce 'Attorney Hub' for both lawyers and consumers","author":{"name":"","url":""},"publishedOn":"","url":"blog\/introducing-attorney-hub","img":{"src":"\/styles\/oakviewlaw\/blob\/images\/blog\/attorneys.png","alt":"Attorneys"},"excerpt":"After months of effort, Oak View Law Group (OVLG) has successfully launched ‘Attorney Hub’ – a platform from which both lawyers and the consumers are going to be benefited. Being a law firm, OVLG has already been working with a huge number of attorneys; however, this ‘Attorney Hub’ is necessarily an attempt to boost the attorney client relationship in a ..."},

{"id":53,"date":"3","month":"Sep","year":"2012","title":"Debtor's prison is back!","author":{"name":"","url":""},"publishedOn":"","url":"blog\/debtors-prison-is-back","img":{"src":"\/styles\/oakviewlaw\/blob\/images\/blog\/yerwada-jail-prisoner-management-system.jpg","alt":""},"excerpt":"Most legal professionals and financial experts would reject the idea of debtor's prison. They might tell you that there is nothing called debtor's prison in today's America. But the idea of putting people behind the bars who can't repay their bills thrives and well in 21st-century America.\r\n\r\nWall Street Journal reports that debt collectors in Illinois, Missouri, ..."},

{"id":54,"date":"24","month":"Aug","year":"2012","title":"Social Security benefit of student loan borrowers gets reduced","author":{"name":"","url":""},"publishedOn":"","url":"blog\/social-security-benefit-of-student-loan-borrowers-gets-reduced","img":{"src":"\/styles\/oakviewlaw\/blob\/images\/blog\/large_bman.jpg","alt":""},"excerpt":"Are you going to retire soon? Do you still have some balance left on your federal student loan? Beware! As the federal government may be targeting your Social Security wages.\r\n\r\nThough the fed has been targeting recent graduates for the student loan debt crisis; it's focus has silently shifted to a completely different crown - the retirees.\r\n\r\nSmart Money’s ..."},

{"id":55,"date":"10","month":"Aug","year":"2012","title":"Can debt devour your Social Security?","author":{"name":"","url":""},"publishedOn":"","url":"blog\/can-debt-devour-your-social-security","img":{"src":"\/styles\/oakviewlaw\/blob\/images\/blog\/devour.jpg","alt":""},"excerpt":"You may be thinking of retiring soon due to poor health reasons. At the same time you may be worried about your debt burdens as you don’t have enough money to be able to pay them off. Moreover, there will be an issue of household budgeting once you retire. You just have no clue as what will happen to your credit card debts once you go for a forced retirement. ..."},

{"id":56,"date":"4","month":"Aug","year":"2012","title":"Sarah Palin - Upset as the debt bills are not posted on the Internet","author":{"name":"","url":""},"publishedOn":"","url":"blog\/sarah-palin-upset-as-the-debt-bills-is-not-posted-on-internet","img":{"src":"\/styles\/oakviewlaw\/blob\/images\/blog\/sarah-palin.jpg","alt":""},"excerpt":"We have rarely seen Sarah Palin in such a frenzy state of mind. Posing a completely different person than what she actually is, Palin straight went on the air with On the Record host Greta Van Susteren and then never looked back - without a halt, without a glitter and without making a single singular point. She just pounced on the Vice President Joe Biden and called ..."},

{"id":57,"date":"31","month":"Jul","year":"2012","title":"7 Characteristics of a debt free life!","author":{"name":"","url":""},"publishedOn":"","url":"blog\/7-characteristics-of-a-debt-free-life","img":{"src":"\/styles\/oakviewlaw\/blob\/images\/blog\/Freedom.jpg","alt":""},"excerpt":"Once I was a debt free soul. I had no student loans and no consumer debt as I had already paid them off with due care. Some of my relatives and friends thought that I’d immediately start spending my suddenly-increased spendable amount. But, proving them wrong, I started saving a certain portion of my income on a monthly savings plan. Everything was going well. I ..."},

{"id":58,"date":"22","month":"Jul","year":"2012","title":"Student loans: 5 Easy ways to ditch","author":{"name":"","url":""},"publishedOn":"","url":"blog\/student-loans-5-easy-ways-to-ditch","img":{"src":"\/styles\/oakviewlaw\/blob\/images\/blog\/lrphotos067753-nyu_debt_8379.jpg","alt":""},"excerpt":"All of us know that a student debt crisis is brewing, but no sign of respite is there in the air. Few non-governmental groups have come up with viable ideas and the federal government is also trying to make some amendments in their policies in order make student loan debt a bit easier to bear. But those who are nearing to their Grad. day or trying to service their ..."},

{"id":59,"date":"13","month":"Jul","year":"2012","title":"Simple steps to file bankruptcy in the US","author":{"name":"","url":""},"publishedOn":"","url":"blog\/simple-steps-to-file-bankruptcy-in-the-us","img":{"src":"\/styles\/oakviewlaw\/blob\/images\/blog\/us-court.gif","alt":""},"excerpt":"Bankruptcy can be a heart-wrenching decision to take; especially if you are aware of its vice consequences. However, at the same time you need to know that this law has been put in place just to protect you from the clutches of the unsavory debts. If you find it almost impossible to manage your delinquent accounts and your creditors are few steps away to pounce on ..."},

{"id":60,"date":"28","month":"May","year":"2012","title":"Top-notch executives of debt collection agency accused of multimillion-dollar fraud","author":{"name":"","url":""},"publishedOn":"","url":"blog\/top-notch-executives-of-debt-collection-agency-accused-of-multimillion-dollar-fraud","img":{"src":"\/styles\/oakviewlaw\/blob\/images\/blog\/CTSeal3.jpg","alt":""},"excerpt":"CONNECTICUT - David B. Fein, United States Attorney for the District of Connecticut, announced few days back that Pinto, 68, of Wellington, Florida, and Peter Pinto, 37, of East Quogue, New York, pleaded guilty on May 11 before the District Judge Stefan Underhill in Bridgeport for committing bank fraud, wire fraud, money laundering, and wire fraud stemming from a $10 ..."},
],
  "profile": {
    "name": "manohar-grmtech"
  }
}
