{
  "blogs":[
  {
    id: 1,
    date: 30,
    month: "Jun",
    year: 2016,
    title: "4th of July 2016: How to celebrate freedom",
    author: { name: "Admin", url: "" },
    publishedOn: "Thu, 06/30/2016 - 00:51",
    url: "blog/4th-of-july-2016-how-to-celebrate-freedom.html",
    img: {
      src: "4th-of-July-How-to-clebrate-freedom.webp",
      alt: "celebrate-freedom",
    },
    excerpt:
      "The 4th of July is observed as a federal holiday in the United States. After all, it’s NATION’S BIRTHDAY! Independence Day celebration is a grand and colorful affair in the country with fireworks, foods, parades, and more. Wondering how to enjoy this wonderful day? Check this out. Known ways to celebrate Independence Day To celebrate the grandeur of the ...",
  },
  {
    id: 2,
    date: 29,
    month: "Jun",
    year: 2016,
    title: "OVLG gave me the perfect recipe to smash debt: Live on one income",
    author: { name: "Admin", url: "" },
    publishedOn: "Wed, 06/29/2016 - 02:05",
    url: "blog/ovlg-gave-me-the-perfect-recipe-to-smash-debt-live-on-one-income.html",
    img: {
      src: "meet-KM-the-girl-who-lived-on-one-income-to-save.webp",
      alt: "become-debt-free-in-one-income",
    },
    excerpt:
      "This post has been made by KM, an ordinary girl who paid off debts by living on one income and accepting OVLG as her financial friend. “Sometimes, I feel that it is more painful to pay off debt than giving birth to a child. The endless negotiations and the stress of carrying debt boulder on your shoulder 24*7 are too much. You can neither sleep nor walk stress- ...",
  },
  {
    id: 3,
    date: 2,
    month: "Apr",
    year: 2016,
    title: "Last-minute financial moves you must make in this tax season",
    author: { name: "Admin", url: "" },
    publishedOn: "Sat, 04/02/2016 - 00:07",
    url: "blog/financial-to-do.html",
    img: {
      src: "Financial-To-Do--Apr-2016-1.webp",
      alt: "april financial to-do",
    },
    excerpt:
      "File a new W-4 form for a better return on investment.Book your air tickets to keep your expenses down on your summer travel plans.Check how your budget performed in the first quarter of 2016. Change it if necessary.Use your extra money to reduce your credit card debts and student loan debts.Make smart investing plans to qualify for tax deductions in the next ...",
  },
  {
    id: 4,
    date: 19,
    month: "Nov",
    year: 2015,
    title: "Thanksgiving 2015: 4 Financial prospects to be thankful for",
    author: { name: "Admin", url: "" },
    publishedOn: "Thu, 11/19/2015 - 02:49",
    url: "blog/thanksgiving-2015-4-financial-prospects-to-be-thankful-for.html",
    img: {
      src: "Thanksgiving-2015-4-Financial-prospects-to-be-thankful-for.webp",
      alt: "thanksgiving-2015-financial-prospects",
    },
    excerpt:
      "You are often thankful for various things like good health, promising relationship, etc. But, why not thank those financial prospects that come your way? I’m not talking about the promotion that you’ve got this year or the biggest trip that you’ve enjoyed with your family. Apart from these, there are still some other reasons that you should be thankful for. ...",
  },
  {
    id: 5,
    date: 4,
    month: "Nov",
    year: 2015,
    title: "This Veterans Day: Show a new path to the veterans",
    author: { name: "Admin", url: "" },
    publishedOn: "Wed, 11/04/2015 - 21:56",
    url: "blog/this-veterans-day-show-a-new-path-to-the-veterans.html",
    img: {
      src: "This-Veterans-Day-Show-a-new-financial-path-to-the-veterans.webp",
      alt: "help-needy-and-retired-veterans",
    },
    excerpt:
      "“A hero is someone who has given his or her life to something bigger than oneself.” - Joseph Campbell.Eleventh November is observed as the Veterans Day. This year let’s plan something different for our heroes. Always remember, the peaceful nights we spend are gifts from the warriors of our country.The experience and courage of our soldiers keep us protected ...",
  }
],
  "profile": {
    "name": "manohar-grmtech"
  }
}
